// 支持中文翻译至其他语言的列表
const LanguageMapping = { 
    "en": "英语", 
    "ara": "阿拉伯语", 
    "est": "爱沙尼亚语", 
    "bul": "保加利亚语", 
    "pl": "波兰语", 
    "dan": "丹麦语", 
    "de": "德语", 
    "ru": "俄语", 
    "fra": "法语", 
    "fin": "芬兰语", 
    "kor": "韩语", 
    "nl": "荷兰语", 
    "cs": "捷克语", 
    "rom": "罗马尼亚语",
    "pt": "葡萄牙语", 
    "jp": "日语", 
    "swe": "瑞典语", 
    "slo": "斯洛文尼亚语", 
    "th": "泰语", 
    "wyw": "文言文", 
    "spa": "西班牙语", 
    "el": "希腊语", 
    "hu": "匈牙利语", 
    "it": "意大利语", 
    "yue": "粤语", 
    "cht": "中文繁体", 
    "vie": "越南语" 
};

module.exports = LanguageMapping;